{"id":"64","name":"Loss And Gain","verse":{"count":18,"data":{"1":"ALL THAT THERE is in the heavens and the earth sings the praises of God. His the sovereignty and His is the praise, and He has power over everything. ","2":"It is He who created you, though one of you is an infidel and one of you a believer; yet God perceives what you do. ","3":"He created the heavens and the earth with deliberation, and gave you form, and shaped you well; and to Him is your returning. ","4":"He knows what is in the heavens and the earth, and knows what you hide and what you disclose; God knows what is in the hearts. ","5":"Has not the account of those who disbelieved before come to you, who tasted the torment of their action, and for whom is grievous punishment? ","6":"This was so because their apostles came to them with clear proofs, but they said: \"What. Can a mortal show us the way?\" And they denied and turned away; but God was unconcerned. God is all-sufficient, worthy of praise. ","7":"The unbelievers claim that they will not be raised again. Tell them: \"Why not? By my Lord, you will certainly be raised again, and then informed of what you had done. That is how the law of God works inevitably.\" ","8":"So believe in God, His Apostle and the Light We have sent down. God is well aware of what you do. ","9":"The day He will gather you together on the Day of Gathering, will be the day of Judgement. He who believed and did the right, will have his evil deeds expunged by God and admitted to gardens with rivers flowing by, and abide there perpetually. This will be the great achievement of success. ","10":"Those who did not believe and denied Our revelations will be inmates of Hell, where they will abide for ever, and how evil a journey´s end! ","11":"No calamity befalls unless God dispenses. He guides the heart of whosoever believes in God; and God has knowledge of everything. ","12":"Obey God and obey His Apostle. If you turn away, the duty of the Apostle is to convey the message clearly. ","13":"God: There is no god but He; and in God should believers place their trust. ","14":"O believers, some of your spouses and children are your enemies, so beware of them! Yet if you forbear, overlook, and forgive, God is indeed forgiving and kind. ","15":"Your wealth and children are surely meant as trial for you: But with God is the great reward. ","16":"So fear God as much as you can, and listen and obey, and spend in charity for your own good. He who is saved from his own avarice will be successful. ","17":"If you lend a goodly loan to God, He will double it for you, and forgive you. God knows the worth of good deeds and is clement, ","18":"The knower of the unknown and the known, all-mighty and all-wise. "}}}