{"id":"79","name":"Those Who Pull Out","verse":{"count":46,"data":{"1":"I CALL TO WITNESS those who dive and drag, ","2":"And those who undo the bonds gently, ","3":"And those who glide swimmingly, ","4":"Then outpace the others swiftly ","5":"And direct affairs by command, ","6":"The day the convulsive (first blast) shatters convulsively ","7":"Followed by the second blast, ","8":"Hearts will pound loudly on that day, ","9":"Eyes be lowered in submission. ","10":"They say: \"Shall we go back to our original state ","11":"After having turned to carious bones?\" ","12":"They say: \"Then this returning will be a dead loss.\" ","13":"It will only be a single blast, ","14":"And they will wake up suddenly. ","15":"Has the story of Moses come to you ","16":"When his Lord called to him in Tuwa´s holy vale? ","17":"\"Go to the Pharaoh who has become refractory, ","18":"And say: ´Would you like to grow (in virtue)? ","19":"Then I will guide you to your Lord that you may come to fear Him.´\" ","20":"So he showed him the greater sign; ","21":"But (the Pharaoh) disavowed and disobeyed. ","22":"Then he turned away, deliberating, ","23":"And assembled (his council) and proclaimed, ","24":"Saying: \"I am alone your lord, the highest of them all.\" ","25":"So God seized him for the punishment of the Hereafter and this world. ","26":"Truly there is a lesson in this for those who fear (the consequences).","27":"Are you more difficult to create or the heavens? He built it,","28":"Raised it high, proportioned it, ","29":"Gave darkness to its night, and brightness to its day; ","30":"And afterwards spread out the earth. ","31":"He brought out its water and its pastures from it, ","32":"And stabilized the mountains ","33":"As convenience for you and your cattle. ","34":"When the great calamity comes, ","35":"The day when man remembers all that he had done, ","36":"And Hell made visible to him who can see, ","37":"Then he who had been rebellious ","38":"And who preferred the life of the world, ","39":"Will surely have Hell for his abode. ","40":"But he who feared standing before his Lord, and restrained his self from vain desires, ","41":"Will surely have Paradise for abode. ","42":"They ask you: \"When will the Hour be? When is its time fixed?\" ","43":"What do you have to do with explaining it? ","44":"The extent of its knowledge goes to your Lord. ","45":"Your duty is only to warn him who fears it. ","46":"The day they see it, it will seem they had stayed in the world but only an evening or its turning into dawn. "}}}