{"id":"73","name":"The Wrapped Up","verse":{"count":20,"data":{"1":"O YOU ENWRAPPED in the cloak (of Prophethood), ","2":"Keep watch all the night except some, ","3":"A half of it or a little less ","4":"Or a little more, and recite the Qur´an slowly and distinctly. ","5":"We shall soon entrust to you a message heavy (with solemnity). ","6":"Surely in the watches of the night the soul is most receptive and words more telling. ","7":"Indeed during the day you have a long schedule of occupations. ","8":"But recite the name of your Lord withdrawing yourself from everything, devoting yourself exclusively to Him. ","9":"He is the Lord of the East and the West. There is no god but He. So take Him alone as your protector. ","10":"Bear with patience what they say, and gracefully come away from them. ","11":"Leave those to Me who deny, the lovers of ease and comfort; and bear with them for a while. ","12":"Verily We shall have fetters with Us, and a roaring furnace, ","13":"And food that will stick in the throat, and painful torment ","14":"On the day the earth and mountains will rock violently, and the mountains turn to a heap of poured-out sand. ","15":"We have sent an Apostle to you as a witness against you, as We had sent an apostle to the Pharaoh. ","16":"But the Pharaoh disobeyed the apostle; so We seized him with a grievous punishment. ","17":"How then, if you disbelieve, will you preserve yourselves on the day which will even turn the children hoary? ","18":"The heavens itself will be rent asunder (on that day). His promise is bound to be fulfilled. ","19":"Verily this is a reminder. So let him who desires take the way to his Lord. ","20":"Your Lord surely knows that you are occupied with your devotions for nearly two-thirds of the night, or half the night, or one-third of it, as do many others with you. Yet God prescribes the measure of night and day. He knows you cannot calculate it, and so turns to you in benevolence. So recite as much of the Qur´an as you can easily. He knows some among you will be sick, and some will be travelling over the earth in search of the bounty of God, and some fighting in the way of God. So read as much from it as you can easily, and be firm in devotion, pay the zakat, and lend a goodly loan to God. And what you send for yourself of the good, you will find it with God better and greater in reward. So ask for God´s forgiveness. Indeed God is forgiving and kind. "}}}