{"id":"44","name":"The Evident Smoke","verse":{"count":59,"data":{"1":"HA MIM. ","2":"The perspicuous Book is witness ","3":"(That) We sent it down one night of blessing -- so that We could warn -- ","4":"On which all affairs are sorted out and decided ","5":"As commands from Us. It is indeed We who send (messengers), ","6":"A mercy from your Lord. Verily He is all-hearing and all-knowing, ","7":"The Lord of the heavens and the earth and all that lies between them, if you really do believe. ","8":"There is no god other than He, who gives you life and death, your Lord and the Lord of your fathers of old. ","9":"Yet they are lost in doubt and play. ","10":"So watch for the day when the sky begins to emit clear smoke, ","11":"Which would envelope mankind. That would be a grievous affliction. ","12":"\"O Lord, take away this torment from us,\" (they will pray); \"we have come to believe.\" ","13":"How can a warning benefit them? The Apostle who explained all things clearly had come to them, ","14":"But they turned away from him, and said: \"He is well-instructed, (but) possessed.\" ","15":"If We remove the torment a little, you revert back (to misdeeds). ","16":"The day that We shall seize them with a grievous hold, We will indeed castigate them. ","17":"We had tried the people of Pharaoh before them. A respected prophet had come to them (saying): ","18":"\"Deliver the creatures of God to me. I am the trusted messenger sent to you. ","19":"Do not think yourselves to be above God: I have come to you with clear authority. ","20":"I have taken refuge in my Lord and your Lord against your stoning me to death. ","21":"If you do not believe in me, leave me alone.\" ","22":"Then he called to his Lord: \"These are a sinful people.\" ","23":"\"Journey by night with My devotees,\" (it was said); \"you will certainly be pursued. ","24":"(Cross and) leave the sea undisturbed. The (pursuing) hosts will surely be drowned,\" ","25":"How many gardens and fountains did they leave behind, ","26":"And fields and stately mansions, ","27":"And the comfort they enjoyed. ","28":"Thus it was; and We passed them on to another people. ","29":"Neither did the heavens weep for them, nor the earth, nor were they granted respite. ","30":"So We saved the children of Israel from degrading suffering ","31":"They (had experienced) under the Pharaoh. He was certainly a tyrant, guilty of excess. ","32":"And We exalted them over the other people knowingly, ","33":"And sent them tokens to bring out the best in them. ","34":"Even then they say: ","35":"\"There is no dying for us but once; and we shall not be raised again. ","36":"So bring our ancestors back, if you are truthful.\" ","37":"Are they better than the people of Tubba, and those who had lived before them, whom We destroyed as they were sinners? ","38":"We have not created the heavens and the earth and all that lies between them, out of play. ","39":"We created them with definite purpose; but most of them do not understand. ","40":"The Day of Judgement is your promised day of meeting, ","41":"The day when friend will help no friend in the least, nor will they be helped, ","42":"Apart from those to whom God is kind. He is all-mighty and all-merciful. ","43":"The tree of Zaqqum will indeed be ","44":"The food of sinners. ","45":"It is like pitch. It will fume in the belly ","46":"As does boiling water. ","47":"\"Seize him and drag him into the depths of Hell,\" (it will be said), ","48":"\"Then pour over his head the torment of scalding water.\" ","49":"\"Taste it,\" (they will be told). \"You were indeed the mighty and noble! ","50":"This is certainly what you had denied.\" ","51":"Surely those who fear and follow the straight path will be in a place of peace and security ","52":"In the midst of gardens and of springs, ","53":"Dressed in brocade and shot silk, facing one another. ","54":"Just like that. We shall pair them with companions with large black eyes. ","55":"They will call for every kind of fruit with satisfaction. ","56":"There they will not know any death apart from the first death they had died, and will be kept safe from the torment of Hell ","57":"By the beneficence of your Lord. This will be the great success. ","58":"Therefore We have made this (Qur´an) easy in your tongue. They may haply take a warning. ","59":"So you wait. They are also waiting. "}}}