{"id":"76","name":"The Man","verse":{"count":31,"data":{"1":"WAS THERE NOT a time in the life of man when he was not even a mentionable thing? ","2":"Verily We created man from a sperm yoked (to the ovum) to bring out his real substance, then gave him hearing and sight. ","3":"We surely showed him the way that he may either be grateful or deny. ","4":"We have prepared for unbelievers chains and collars and a blazing fire. ","5":"Surely the devotees will drink cups flavoured with palm blossoms ","6":"From a spring of which the votaries of God will drink and make it flow in abundance. ","7":"Those who fulfil their vows and fear the Day whose evil shall be diffused far and wide, ","8":"And feed the needy for the love of Him, and the orphans and the captives, ","9":"(Saying): \"We feed you for the sake of God, desiring neither recompense nor thanks. ","10":"We fear the dismal day calamitous from our Lord.\" ","11":"So God will protect them from the evil of that day, and grant them happiness and joy, ","12":"And reward them for their perseverence Paradise and silken robes, ","13":"Where they will recline on couches feeling neither heat of the sun nor intense cold. ","14":"The shadows will bend over them, and low will hang the clusters of grapes. ","15":"Passed round will be silver flagons and goblets made of glass, ","16":"And crystal clear bottles of silver, of which they will determine the measure themselves. ","17":"There will they drink a cup flavoured with ginger ","18":"From a spring by the name of Ever-flowing-Salsabil. ","19":"And boys of everlasting youth will go about attending them. Looking at them you would think that they were pearls dispersed. ","20":"When you look around, you will see delights and great dominion. ","21":"On their bodies will be garments of the finest green silk and brocade, and they will be adorned with bracelets of silver; and their Lord will give them a purest draught to drink. ","22":"\"This in truth is your recompense, and acceptance of your endeavours.\"","23":"We have revealed the Qur´an to you gradually;","24":"So wait for your Lord´s command, and do not follow any sinner or disbeliever among them. ","25":"Meditate upon the name of your Lord morning and evening; ","26":"And bow in homage part of the night, and glorify Him far into the night. ","27":"Surely men love what hastes away and forget the grievous day (ahead). ","28":"We created them and fixed their bones and joints; and We could replace them when We like with others like them. ","29":"This surely is a reminder: Therefore whosoever desires may take the way to his Lord. ","30":"But you will not desire except as God wills. Verily He is all-knowing and all-wise. ","31":"He admits whosoever He will to His benevolence. But for the evil-doers He has prepared a painful punishment. "}}}