{"id":"78","name":"The Great Event","verse":{"count":40,"data":{"1":"OF WHAT ARE they asking one another? ","2":"(Is it) of the great announcement ","3":"About which they have been differing? ","4":"Indeed they will come to know soon; ","5":"They will indeed come to know soon. ","6":"Did We not make the earth a spreading, ","7":"The mountains tent-pins? ","8":"We created you in pairs, ","9":"And made sleep for you to rest, ","10":"The night a covering, ","11":"And the day for seeking livelihood. ","12":"We raised over you several secure (skies), ","13":"And placed a lamp therein brightly burning. ","14":"And We sent down rain from water-laden clouds pouring in torrents ","15":"That We may produce from it grain and vegetation, ","16":"And orchards full of trees and interlacing boughs. ","17":"Surely a time is fixed for the Day of Judgement. ","18":"The day the trumpet blast is sounded you will come in hordes; ","19":"The heavens will be opened wide and turn into so many doors, ","20":"The mountains put in motion turning into a mirage. ","21":"Certainly Hell lies in wait, ","22":"The rebels´ abode, ","23":"Where they will remain for aeons, ","24":"Finding neither sleep nor any thing to drink ","25":"Except boiling water and benumbing cold: ","26":", A fitting reward. ","27":"They were those who did not expect a reckoning, ","28":"And rejected Our signs as lies. ","29":"We have kept account of everything in a book. ","30":"So taste (the fruit of what you sowed), for We shall add nothing but torment, ","31":"As for those who preserve themselves from evil and follow the straight path, there is attainment for them: ","32":"Orchards and vineyards, ","33":"And graceful maidens of the same age, ","34":"And flasks full and flowing. ","35":"They will hear no blasphemies there or disavowals: ","36":"A recompense from your Lord, a sufficient gift, ","37":"The Lord of the heavens and the earth, and all that lies between them, most benevolent, to whom none may dare address a word. ","38":"The day the Spirit takes its stand, with the angels ranged in rows. None will speak except who is permitted by Ar-Rahman and says what is right. ","39":"That day is certain. So whosoever likes may prepare a way to his Lord. ","40":"We have indeed warned you of a calamity near at hand, a day when man will see what he had sent (of his deeds) ahead, and the unbeliever will say: \"Woe alas. Ah would that I were dust!\" "}}}