{"id":"74","name":"The Clothe Done","verse":{"count":56,"data":{"1":"O YOU ENFOLDED in your mantle (of reform), ","2":"Arise and warn, ","3":"Glorify your Lord, ","4":"Purify your inner self, ","5":"And banish all trepidation. ","6":"Do not bestow favours in expectation of return, ","7":"And persevere in the way of your Lord. ","8":"For when the trumpet blows ","9":"It will be a day of distress, ","10":"Dolorous for the unbelievers. ","11":"Leave him to Me whom I created alone, ","12":"And gave him abundant wealth ","13":"And sons always present by his side, ","14":"And made things easy for them. ","15":"Yet he wants that I should give him more. ","16":"Never. He is refractory of Our signs. ","17":"I shall inflict on him hardship, ","18":"For he had thought and calculated. ","19":"May he be accursed, how he planned! ","20":"May be then be accursed, how he plotted! ","21":"Then he looked around, ","22":"And frowned and puckered his brow, ","23":"Then turned his back and waxed proud, ","24":"And said: \"This is nothing but the magic of old, ","25":"Nothing more than the speech of a man!\" ","26":"I will cast him into the fire of Hell. ","27":"What do you think Hell-fire is? ","28":"It leaves nothing, nor does it spare; ","29":"It glows and burns the skin. ","30":"Over it are nineteen (guards). ","31":"We have not appointed any one but angels as keepers of Hell, and their number that We have fixed is to make it a means of contention for disbelievers, so that those who were given the Book may be certain, and the faith of the believers may have greater increase, and the people of the Book and believers may not be deceived, and the sceptics and infidels may say: \"What does God mean by this parable?\" That is how God leads whosoever He will astray, and guides whosoever He will. None knows the armies of your Lord save Him self. This is no more than reminder for mankind. ","32":"I say the truth, and call the moon to witness, ","33":"And the night when on the wane, ","34":"The morning when it is unveiled, ","35":"That (Hell) is surely one of the greater (signs), ","36":"A warning for people -- ","37":"Whoever of you desires to progress or lag behind. ","38":"Every soul is pledged to what it does, ","39":"Except those of the right hand ","40":"Sitting in the gardens, asking ","41":"Of evil-doers: ","42":"\"What was it that brought you to Hell?\" ","43":"They will answer: \"We did not fulfil our devotional obligations, ","44":"And did not feed the needy, ","45":"And plunged into useless things with those who were obstinate, ","46":"And rejected the Day of Judgement as a lie ","47":"Until the certainty (of death) had come upon us. ","48":"So, the intercession of intercessors will not avail them. ","49":"Why then do they turn away from the admonition ","50":"As though they were frightened asses ","51":"Fleeing from a lion? ","52":"In fact every one of them wants to be given open books (like the prophets). ","53":"By no means. In fact they do not fear the Hereafter. ","54":"Never so, as this is a reminder. ","55":"Let him then who heeds remember it. ","56":"But they will not remember except as God wills: He is worthy to be feared, and He is worthy of forgiving "}}}